{"inkVersion":21,"root":[["#","^image: rkhmjcwqsmgzqtmvdblm.supabase.co/storage/v1/object/public/admin-assets/1769136507639_dark_interrogation_room.png","/#","^It's a cold, rainy saturday morning. You are a detective. You've been tasked to investigate a suspect. The rain hammers against the single window of glass in the interrogation room. It is the only sound in the station at this hour.","\n","^The suspect sits on the other side of the metal table. He is not what you expected. He has no scars, no tattoos. Just a calm looking guy, with a relaxed expression.","\n","^He is waiting for you to make the first move.","\n","ev","str","^Tap your pen rhythmically on the desk","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Lean close to the mic and whisper","/str","/ev",{"*":"0.c-1","flg":20},"ev","str","^Rustle the case file papers loudly","/str","/ev",{"*":"0.c-2","flg":20},{"c-0":["\n","^You make sure to be as loud as you can. Tap. Tap. Tap.","\n","^Then you ask him.","\n","^\"Do you know why you're here?\"","\n","ev","str","^serious","/str","/ev",{"VAR=":"mood","re":true},{"->":"opener_response"},{"->":"0.g-0"},{"#f":5}],"c-1":["\n","^You lean in, making sure to add a dangerous edge to your voice as you whisper.","\n","^\"You look comfortable. Maybe too comfortable.\"","\n","ev","str","^intimate","/str","/ev",{"VAR=":"mood","re":true},{"->":"opener_response"},{"->":"0.g-0"},{"#f":5}],"c-2":["\n","^You slam the file open and and flip through the stapled documents. The sound of paper rubbing against each other is loud and sharp. Then you address him.","\n","^\"I've got a lot of paper here. And it all points to you.\"","\n","ev","str","^aggressive","/str","/ev",{"VAR=":"mood","re":true},{"->":"opener_response"},{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"opener_response":["^The suspect watches you. He doesn't flinch at the noise.","\n","ev",{"VAR?":"mood"},"str","^serious","/str","==","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"I assume I'm here because of something you think I did, Detective, which I didn't do.\" he says, glancing at your pen. \"By the way, nice rhythm. You have a good tempo, Detective.\"","\n",{"->":".^.^.^.10"},null]}],"nop","\n","ev",{"VAR?":"mood"},"str","^intimate","/str","==","/ev",[{"->":".^.b","c":true},{"b":["\n","^He leans in too, and lowers his voice to match your volume. \"Comfort is a state of mind Detective,\" he whispers back. \"I'm just enjoying the quiet. Is that a crime? Wanna add that to my files?\"","\n",{"->":".^.^.^.20"},null]}],"nop","\n","ev",{"VAR?":"mood"},"str","^aggressive","/str","==","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Paper trails? hehehe\" he chuckles. \"They can be misleading. Sometimes they lead you exactly where you need to be, even if it's the wrong answer.\"","\n",{"->":".^.^.^.30"},null]}],"nop","\n","^He rests his elbows on the table.","\n","^\"So, are we going to do this the hard way, or the interesting way?\"","\n",{"->":"choice_set_2"},{"#f":1}],"choice_set_2":[["^You don't like his confidence level. He doesn't seem afraid in the slightest bit, which is bad for you.","\n","^Years of experience in this line of work has thought you that suspects cooperate better when they are afraid. You need to press him harder.","\n","ev","str","^Put on latex gloves (Snap the wristband while doing so)","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Type rhythmically on a mechanical keyboard","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Pour water into a glass (Liquid sounds)","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^You pick up your tight latex gloves and slide your hands into it. The material swishes and rustles as you wear it. You snap the wristband against your skin. *Snap.*","\n","^From the corner of your eyes, you notice him watching your hand movements, so you say","\n","^\"Don't worry, I'm just being thorough. I don't want to miss a single detail.\"","\n",{"->":"gloves_reaction"},{"#f":5}],"c-1":["\n","^You turn to your laptop. The keys clack loudly as you punch the buttons, amplified by the silence. *Click-clack-click.*","\n","^\"I'm running your profile again.\" You tell him. \"A man with your skills doesn't just appear out of nowhere.\"","\n",{"->":"typing_reaction"},{"#f":5}],"c-2":["\n","^You pick up a jug and pour water into a clear glass. The liquid glugs and swirls. When you've filled the glass, you slide it across the table.","\n","^\"You look thirsty. Drink.\"","\n",{"->":"water_reaction"},{"#f":5}]}],{"#f":1}],"gloves_reaction":["^He doesn't take his eyes off your hands.","\n","^\"Clinical,\" he murmurs. \"You treat this like a science. I respect that. Detail is everything in my line of work, too.\"","\n",{"->":"deep_dive"},{"#f":1}],"typing_reaction":["^He closes his eyes as he listens, as if enjoying the rhythm of your typing.","\n","^\"Detective oh Detective. Are you sure running my profile? Because it sounds like code,\" he says. \"I spend my life behind screens, Detective. Building systems. Creating worlds. I know the sound of someone looking for a bug in the code.\"","\n",{"->":"deep_dive"},{"#f":1}],"water_reaction":["^He takes the glass with two hands. He doesn't drink immediately; he first watches the water settle.","\n","^\"Kindness,\" he notes as he looks at you suspiciously. \"Or is it a trick? To make me lower my guard? Hmm I think It's working,\" he says as he drinks. He drains every drop and slides the glass back to you, the uses his elbow to wipe his mouth.","\n",{"->":"deep_dive"},{"#f":1}],"deep_dive":["^He leans forward and locks eyes with you. The way the shadows catch angle of his jaw makes him look mysterious.","\n","^\"I know what you are Detective. You aren't looking for a criminal, are you? You're looking for a motive.\"","\n",{"->":"choice_set_3"},{"#f":1}],"choice_set_3":[["^The rain outside becomes louder. The room also now feels smaller. This guy is not giving in. A real menance.","\n","^You have one final card to play. The piece of evidence that ties everything together.","\n","^\"Enough games,\" you say. \"I know who you really are.\"","\n","ev","str","^Shine a flashlight in his face (Visual Trigger)","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Slide the 'Evidence Folder' across the table (Paper Sound)","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^You click a flashlight on. The beam is very bright in the dark room, illuminating his face.","\n","^\"Don't lie to me. The light reveals everything.\"","\n",{"->":"flashlight_reveal"},{"#f":5}],"c-1":["\n","^You slide a manila folder across the metal table. which makes a *Schhhhk.* sound","\n","^\"It's all in here. Your history. Your projects. Your name.\"","\n",{"->":"folder_reveal"},{"#f":5}]}],{"#f":1}],"flashlight_reveal":["^He blinks against the harsh light, but he doesn't look away. A slow smile spreads across his face.","\n","^\"Truly, yes. The light reveals what is there,\" he agrees. \"But it also casts shadows on what isn't.\"","\n",{"->":"the_truth"},{"#f":1}],"folder_reveal":["^He looks down at the folder and slowly he reaches out, not to open it, but to rest his hand on top of it.","\n","^\"You've done your homework,\" he says. \"I'm impressed. Most people don't get this far.\"","\n",{"->":"the_truth"},{"#f":1}],"the_truth":[["^He leans back, and for the first time, the \"Suspect\" persona seems to fade. That cold calculated look he's as had around him since the beginning starts to give way to something more human and vulnerable. The atmosphere in the room shifts from 'Interrogation' to 'Conversation'.","\n","^\"I suppose I should confess,\" he says softy.","\n","^\"I'm not a criminal, Detective. I'm a builder. And I'm guilty of exactly one thing.\"","\n",["ev",{"^->":"the_truth.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"And what is that?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"the_truth.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"final_confession"},{"#f":5}]}],{"#f":1}],"final_confession":[["^\"Trying to get the attention of someone I admire.\"","\n","^The room fades away. The rain stops.","\n","^The file on the table opens.","\n","#","^image: rkhmjcwqsmgzqtmvdblm.supabase.co/storage/v1/object/public/admin-assets/1769142753365_1763221434080_2a79acc0-f2bd-4c69-beb9-1e89ecf625e1_(1)_(1).jpeg","/#","^SUBJECT: Lotanna","\n","^ROLE: Full-Stack Engineer / Narrative Designer","\n","^CRIME: Shooting his shot.","\n","^\"Hi Maggy. I know this is an unusual way to introduce myself, but I wanted to make something for you rather than just writing an email.\"","\n","^\"I build interactive stories like this (and the engine running it). If you enjoyed this little experiment, or if you ever need a custom interactive element for your channel, I'd love to chat.\"","\n","ev","str","^Close the Case File","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","end",{"#f":5}]}],{"#f":1}],"global decl":["ev","str","^neutral","/str",{"VAR=":"mood"},"/ev","end",null],"#f":1}],"listDefs":{}}